{"class_name": "Model", "config": {"input_layers": [["input_4", 0, 0]], "name": "NASNet", "output_layers": [["predictions", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "sparse": false, "dtype": "float32", "name": "input_4"}, "inbound_nodes": [], "name": "input_4"}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "stem_conv1", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["input_4", 0, 0, {}]]], "name": "stem_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "stem_bn1"}, "inbound_nodes": [[["stem_conv1", 0, 0, {}]]], "name": "stem_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_376"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_376"}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "dilation_rate": [1, 1], "filters": 32, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "normal_conv_1_0", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_376", 0, 0, {}]]], "name": "normal_conv_1_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "normal_bn_1_0"}, "inbound_nodes": [[["normal_conv_1_0", 0, 0, {}]]], "name": "normal_bn_1_0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_377"}, "inbound_nodes": [[["normal_bn_1_0", 0, 0, {}]]], "name": "activation_377"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_379"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_379"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_381"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_381"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_383"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_383"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_385"}, "inbound_nodes": [[["normal_bn_1_0", 0, 0, {}]]], "name": "activation_385"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left1_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_377", 0, 0, {}]]], "name": "separable_conv_1_normal_left1_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_right1_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_379", 0, 0, {}]]], "name": "separable_conv_1_normal_right1_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left2_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_381", 0, 0, {}]]], "name": "separable_conv_1_normal_left2_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_right2_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_383", 0, 0, {}]]], "name": "separable_conv_1_normal_right2_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left5_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_385", 0, 0, {}]]], "name": "separable_conv_1_normal_left5_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_left1_0"}, "inbound_nodes": [[["separable_conv_1_normal_left1_0", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_left1_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_right1_0"}, "inbound_nodes": [[["separable_conv_1_normal_right1_0", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_right1_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_left2_0"}, "inbound_nodes": [[["separable_conv_1_normal_left2_0", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_left2_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_right2_0"}, "inbound_nodes": [[["separable_conv_1_normal_right2_0", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_right2_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_left5_0"}, "inbound_nodes": [[["separable_conv_1_normal_left5_0", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_left5_0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_378"}, "inbound_nodes": [[["separable_conv_1_bn_normal_left1_0", 0, 0, {}]]], "name": "activation_378"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_380"}, "inbound_nodes": [[["separable_conv_1_bn_normal_right1_0", 0, 0, {}]]], "name": "activation_380"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_382"}, "inbound_nodes": [[["separable_conv_1_bn_normal_left2_0", 0, 0, {}]]], "name": "activation_382"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_384"}, "inbound_nodes": [[["separable_conv_1_bn_normal_right2_0", 0, 0, {}]]], "name": "activation_384"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_386"}, "inbound_nodes": [[["separable_conv_1_bn_normal_left5_0", 0, 0, {}]]], "name": "activation_386"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_left1_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_378", 0, 0, {}]]], "name": "separable_conv_2_normal_left1_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_right1_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_380", 0, 0, {}]]], "name": "separable_conv_2_normal_right1_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_left2_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_382", 0, 0, {}]]], "name": "separable_conv_2_normal_left2_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_right2_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_384", 0, 0, {}]]], "name": "separable_conv_2_normal_right2_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_left5_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_386", 0, 0, {}]]], "name": "separable_conv_2_normal_left5_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_left1_0"}, "inbound_nodes": [[["separable_conv_2_normal_left1_0", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_left1_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_right1_0"}, "inbound_nodes": [[["separable_conv_2_normal_right1_0", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_right1_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_left2_0"}, "inbound_nodes": [[["separable_conv_2_normal_left2_0", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_left2_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_right2_0"}, "inbound_nodes": [[["separable_conv_2_normal_right2_0", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_right2_0"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "normal_left3_0"}, "inbound_nodes": [[["normal_bn_1_0", 0, 0, {}]]], "name": "normal_left3_0"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "normal_left4_0"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "normal_left4_0"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "normal_right4_0"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "normal_right4_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_left5_0"}, "inbound_nodes": [[["separable_conv_2_normal_left5_0", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_left5_0"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_1_0"}, "inbound_nodes": [[["separable_conv_2_bn_normal_left1_0", 0, 0, {}], ["separable_conv_2_bn_normal_right1_0", 0, 0, {}]]], "name": "normal_add_1_0"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_2_0"}, "inbound_nodes": [[["separable_conv_2_bn_normal_left2_0", 0, 0, {}], ["separable_conv_2_bn_normal_right2_0", 0, 0, {}]]], "name": "normal_add_2_0"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_3_0"}, "inbound_nodes": [[["normal_left3_0", 0, 0, {}], ["stem_bn1", 0, 0, {}]]], "name": "normal_add_3_0"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_4_0"}, "inbound_nodes": [[["normal_left4_0", 0, 0, {}], ["normal_right4_0", 0, 0, {}]]], "name": "normal_add_4_0"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_5_0"}, "inbound_nodes": [[["separable_conv_2_bn_normal_left5_0", 0, 0, {}], ["normal_bn_1_0", 0, 0, {}]]], "name": "normal_add_5_0"}, {"class_name": "Concatenate", "config": {"axis": -1, "trainable": true, "name": "normal_concat_0"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}], ["normal_add_1_0", 0, 0, {}], ["normal_add_2_0", 0, 0, {}], ["normal_add_3_0", 0, 0, {}], ["normal_add_4_0", 0, 0, {}], ["normal_add_5_0", 0, 0, {}]]], "name": "normal_concat_0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_387"}, "inbound_nodes": [[["normal_concat_0", 0, 0, {}]]], "name": "activation_387"}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "dilation_rate": [1, 1], "filters": 32, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "normal_conv_1_1", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_387", 0, 0, {}]]], "name": "normal_conv_1_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "normal_bn_1_1"}, "inbound_nodes": [[["normal_conv_1_1", 0, 0, {}]]], "name": "normal_bn_1_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_388"}, "inbound_nodes": [[["normal_bn_1_1", 0, 0, {}]]], "name": "activation_388"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_390"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_390"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_392"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_392"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_394"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_394"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_396"}, "inbound_nodes": [[["normal_bn_1_1", 0, 0, {}]]], "name": "activation_396"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left1_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_388", 0, 0, {}]]], "name": "separable_conv_1_normal_left1_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_right1_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_390", 0, 0, {}]]], "name": "separable_conv_1_normal_right1_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left2_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_392", 0, 0, {}]]], "name": "separable_conv_1_normal_left2_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_right2_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_394", 0, 0, {}]]], "name": "separable_conv_1_normal_right2_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left5_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_396", 0, 0, {}]]], "name": "separable_conv_1_normal_left5_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_left1_1"}, "inbound_nodes": [[["separable_conv_1_normal_left1_1", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_left1_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_right1_1"}, "inbound_nodes": [[["separable_conv_1_normal_right1_1", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_right1_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_left2_1"}, "inbound_nodes": [[["separable_conv_1_normal_left2_1", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_left2_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_right2_1"}, "inbound_nodes": [[["separable_conv_1_normal_right2_1", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_right2_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_left5_1"}, "inbound_nodes": [[["separable_conv_1_normal_left5_1", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_left5_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_389"}, "inbound_nodes": [[["separable_conv_1_bn_normal_left1_1", 0, 0, {}]]], "name": "activation_389"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_391"}, "inbound_nodes": [[["separable_conv_1_bn_normal_right1_1", 0, 0, {}]]], "name": "activation_391"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_393"}, "inbound_nodes": [[["separable_conv_1_bn_normal_left2_1", 0, 0, {}]]], "name": "activation_393"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_395"}, "inbound_nodes": [[["separable_conv_1_bn_normal_right2_1", 0, 0, {}]]], "name": "activation_395"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_397"}, "inbound_nodes": [[["separable_conv_1_bn_normal_left5_1", 0, 0, {}]]], "name": "activation_397"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_left1_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_389", 0, 0, {}]]], "name": "separable_conv_2_normal_left1_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_right1_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_391", 0, 0, {}]]], "name": "separable_conv_2_normal_right1_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_left2_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_393", 0, 0, {}]]], "name": "separable_conv_2_normal_left2_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_right2_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_395", 0, 0, {}]]], "name": "separable_conv_2_normal_right2_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_left5_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_397", 0, 0, {}]]], "name": "separable_conv_2_normal_left5_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_left1_1"}, "inbound_nodes": [[["separable_conv_2_normal_left1_1", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_left1_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_right1_1"}, "inbound_nodes": [[["separable_conv_2_normal_right1_1", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_right1_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_left2_1"}, "inbound_nodes": [[["separable_conv_2_normal_left2_1", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_left2_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_right2_1"}, "inbound_nodes": [[["separable_conv_2_normal_right2_1", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_right2_1"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "normal_left3_1"}, "inbound_nodes": [[["normal_bn_1_1", 0, 0, {}]]], "name": "normal_left3_1"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "normal_left4_1"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "normal_left4_1"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "normal_right4_1"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "normal_right4_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_left5_1"}, "inbound_nodes": [[["separable_conv_2_normal_left5_1", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_left5_1"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_1_1"}, "inbound_nodes": [[["separable_conv_2_bn_normal_left1_1", 0, 0, {}], ["separable_conv_2_bn_normal_right1_1", 0, 0, {}]]], "name": "normal_add_1_1"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_2_1"}, "inbound_nodes": [[["separable_conv_2_bn_normal_left2_1", 0, 0, {}], ["separable_conv_2_bn_normal_right2_1", 0, 0, {}]]], "name": "normal_add_2_1"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_3_1"}, "inbound_nodes": [[["normal_left3_1", 0, 0, {}], ["stem_bn1", 0, 0, {}]]], "name": "normal_add_3_1"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_4_1"}, "inbound_nodes": [[["normal_left4_1", 0, 0, {}], ["normal_right4_1", 0, 0, {}]]], "name": "normal_add_4_1"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_5_1"}, "inbound_nodes": [[["separable_conv_2_bn_normal_left5_1", 0, 0, {}], ["normal_bn_1_1", 0, 0, {}]]], "name": "normal_add_5_1"}, {"class_name": "Concatenate", "config": {"axis": -1, "trainable": true, "name": "normal_concat_1"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}], ["normal_add_1_1", 0, 0, {}], ["normal_add_2_1", 0, 0, {}], ["normal_add_3_1", 0, 0, {}], ["normal_add_4_1", 0, 0, {}], ["normal_add_5_1", 0, 0, {}]]], "name": "normal_concat_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_398"}, "inbound_nodes": [[["normal_concat_0", 0, 0, {}]]], "name": "activation_398"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_399"}, "inbound_nodes": [[["normal_concat_1", 0, 0, {}]]], "name": "activation_399"}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "dilation_rate": [1, 1], "filters": 32, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "adjust_conv_projection_2", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_398", 0, 0, {}]]], "name": "adjust_conv_projection_2"}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "dilation_rate": [1, 1], "filters": 32, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "normal_conv_1_2", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_399", 0, 0, {}]]], "name": "normal_conv_1_2"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "adjust_bn_2"}, "inbound_nodes": [[["adjust_conv_projection_2", 0, 0, {}]]], "name": "adjust_bn_2"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "normal_bn_1_2"}, "inbound_nodes": [[["normal_conv_1_2", 0, 0, {}]]], "name": "normal_bn_1_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_400"}, "inbound_nodes": [[["normal_bn_1_2", 0, 0, {}]]], "name": "activation_400"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_402"}, "inbound_nodes": [[["adjust_bn_2", 0, 0, {}]]], "name": "activation_402"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_404"}, "inbound_nodes": [[["adjust_bn_2", 0, 0, {}]]], "name": "activation_404"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_406"}, "inbound_nodes": [[["adjust_bn_2", 0, 0, {}]]], "name": "activation_406"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_408"}, "inbound_nodes": [[["normal_bn_1_2", 0, 0, {}]]], "name": "activation_408"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left1_2", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, 