{"class_name": "Model", "config": {"input_layers": [["input_10", 0, 0]], "name": "NASNet", "output_layers": [["predictions", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "sparse": false, "dtype": "float32", "name": "input_10"}, "inbound_nodes": [], "name": "input_10"}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "stem_conv1", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["input_10", 0, 0, {}]]], "name": "stem_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "stem_bn1"}, "inbound_nodes": [[["stem_conv1", 0, 0, {}]]], "name": "stem_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1282"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_1282"}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "dilation_rate": [1, 1], "filters": 32, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "normal_conv_1_0", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_1282", 0, 0, {}]]], "name": "normal_conv_1_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "normal_bn_1_0"}, "inbound_nodes": [[["normal_conv_1_0", 0, 0, {}]]], "name": "normal_bn_1_0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1283"}, "inbound_nodes": [[["normal_bn_1_0", 0, 0, {}]]], "name": "activation_1283"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1285"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_1285"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1287"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_1287"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1289"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_1289"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1291"}, "inbound_nodes": [[["normal_bn_1_0", 0, 0, {}]]], "name": "activation_1291"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left1_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_1283", 0, 0, {}]]], "name": "separable_conv_1_normal_left1_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_right1_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_1285", 0, 0, {}]]], "name": "separable_conv_1_normal_right1_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left2_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_1287", 0, 0, {}]]], "name": "separable_conv_1_normal_left2_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_right2_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_1289", 0, 0, {}]]], "name": "separable_conv_1_normal_right2_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left5_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_1291", 0, 0, {}]]], "name": "separable_conv_1_normal_left5_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_left1_0"}, "inbound_nodes": [[["separable_conv_1_normal_left1_0", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_left1_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_right1_0"}, "inbound_nodes": [[["separable_conv_1_normal_right1_0", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_right1_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_left2_0"}, "inbound_nodes": [[["separable_conv_1_normal_left2_0", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_left2_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_right2_0"}, "inbound_nodes": [[["separable_conv_1_normal_right2_0", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_right2_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_left5_0"}, "inbound_nodes": [[["separable_conv_1_normal_left5_0", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_left5_0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1284"}, "inbound_nodes": [[["separable_conv_1_bn_normal_left1_0", 0, 0, {}]]], "name": "activation_1284"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1286"}, "inbound_nodes": [[["separable_conv_1_bn_normal_right1_0", 0, 0, {}]]], "name": "activation_1286"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1288"}, "inbound_nodes": [[["separable_conv_1_bn_normal_left2_0", 0, 0, {}]]], "name": "activation_1288"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1290"}, "inbound_nodes": [[["separable_conv_1_bn_normal_right2_0", 0, 0, {}]]], "name": "activation_1290"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1292"}, "inbound_nodes": [[["separable_conv_1_bn_normal_left5_0", 0, 0, {}]]], "name": "activation_1292"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_left1_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_1284", 0, 0, {}]]], "name": "separable_conv_2_normal_left1_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_right1_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_1286", 0, 0, {}]]], "name": "separable_conv_2_normal_right1_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_left2_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_1288", 0, 0, {}]]], "name": "separable_conv_2_normal_left2_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_right2_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_1290", 0, 0, {}]]], "name": "separable_conv_2_normal_right2_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_left5_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_1292", 0, 0, {}]]], "name": "separable_conv_2_normal_left5_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_left1_0"}, "inbound_nodes": [[["separable_conv_2_normal_left1_0", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_left1_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_right1_0"}, "inbound_nodes": [[["separable_conv_2_normal_right1_0", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_right1_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_left2_0"}, "inbound_nodes": [[["separable_conv_2_normal_left2_0", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_left2_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_right2_0"}, "inbound_nodes": [[["separable_conv_2_normal_right2_0", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_right2_0"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "normal_left3_0"}, "inbound_nodes": [[["normal_bn_1_0", 0, 0, {}]]], "name": "normal_left3_0"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "normal_left4_0"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "normal_left4_0"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "normal_right4_0"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "normal_right4_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_left5_0"}, "inbound_nodes": [[["separable_conv_2_normal_left5_0", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_left5_0"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_1_0"}, "inbound_nodes": [[["separable_conv_2_bn_normal_left1_0", 0, 0, {}], ["separable_conv_2_bn_normal_right1_0", 0, 0, {}]]], "name": "normal_add_1_0"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_2_0"}, "inbound_nodes": [[["separable_conv_2_bn_normal_left2_0", 0, 0, {}], ["separable_conv_2_bn_normal_right2_0", 0, 0, {}]]], "name": "normal_add_2_0"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_3_0"}, "inbound_nodes": [[["normal_left3_0", 0, 0, {}], ["stem_bn1", 0, 0, {}]]], "name": "normal_add_3_0"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_4_0"}, "inbound_nodes": [[["normal_left4_0", 0, 0, {}], ["normal_right4_0", 0, 0, {}]]], "name": "normal_add_4_0"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_5_0"}, "inbound_nodes": [[["separable_conv_2_bn_normal_left5_0", 0, 0, {}], ["normal_bn_1_0", 0, 0, {}]]], "name": "normal_add_5_0"}, {"class_name": "Concatenate", "config": {"axis": -1, "trainable": true, "name": "normal_concat_0"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}], ["normal_add_1_0", 0, 0, {}], ["normal_add_2_0", 0, 0, {}], ["normal_add_3_0", 0, 0, {}], ["normal_add_4_0", 0, 0, {}], ["normal_add_5_0", 0, 0, {}]]], "name": "normal_concat_0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1293"}, "inbound_nodes": [[["normal_concat_0", 0, 0, {}]]], "name": "activation_1293"}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "dilation_rate": [1, 1], "filters": 32, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "normal_conv_1_1", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_1293", 0, 0, {}]]], "name": "normal_conv_1_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "normal_bn_1_1"}, "inbound_nodes": [[["normal_conv_1_1", 0, 0, {}]]], "name": "normal_bn_1_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1294"}, "inbound_nodes": [[["normal_bn_1_1", 0, 0, {}]]], "name": "activation_1294"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1296"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_1296"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1298"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_1298"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1300"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_1300"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1302"}, "inbound_nodes": [[["normal_bn_1_1", 0, 0, {}]]], "name": "activation_1302"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left1_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_1294", 0, 0, {}]]], "name": "separable_conv_1_normal_left1_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_right1_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_1296", 0, 0, {}]]], "name": "separable_conv_1_normal_right1_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left2_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_1298", 0, 0, {}]]], "name": "separable_conv_1_normal_left2_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_right2_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_1300", 0, 0, {}]]], "name": "separable_conv_1_normal_right2_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left5_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_1302", 0, 0, {}]]], "name": "separable_conv_1_normal_left5_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_left1_1"}, "inbound_nodes": [[["separable_conv_1_normal_left1_1", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_left1_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_right1_1"}, "inbound_nodes": [[["separable_conv_1_normal_right1_1", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_right1_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_left2_1"}, "inbound_nodes": [[["separable_conv_1_normal_left2_1", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_left2_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_right2_1"}, "inbound_nodes": [[["separable_conv_1_normal_right2_1", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_right2_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_left5_1"}, "inbound_nodes": [[["separable_conv_1_normal_left5_1", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_left5_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1295"}, "inbound_nodes": [[["separable_conv_1_bn_normal_left1_1", 0, 0, {}]]], "name": "activation_1295"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1297"}, "inbound_nodes": [[["separable_conv_1_bn_normal_right1_1", 0, 0, {}]]], "name": "activation_1297"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1299"}, "inbound_nodes": [[["separable_conv_1_bn_normal_left2_1", 0, 0, {}]]], "name": "activation_1299"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1301"}, "inbound_nodes": [[["separable_conv_1_bn_normal_right2_1", 0, 0, {}]]], "name": "activation_1301"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1303"}, "inbound_nodes": [[["separable_conv_1_bn_normal_left5_1", 0, 0, {}]]], "name": "activation_1303"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_left1_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_1295", 0, 0, {}]]], "name": "separable_conv_2_normal_left1_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_right1_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_1297", 0, 0, {}]]], "name": "separable_conv_2_normal_right1_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_left2_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_1299", 0, 0, {}]]], "name": "separable_conv_2_normal_left2_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_right2_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_1301", 0, 0, {}]]], "name": "separable_conv_2_normal_right2_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_left5_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_1303", 0, 0, {}]]], "name": "separable_conv_2_normal_left5_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_left1_1"}, "inbound_nodes": [[["separable_conv_2_normal_left1_1", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_left1_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_right1_1"}, "inbound_nodes": [[["separable_conv_2_normal_right1_1", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_right1_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_left2_1"}, "inbound_nodes": [[["separable_conv_2_normal_left2_1", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_left2_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_right2_1"}, "inbound_nodes": [[["separable_conv_2_normal_right2_1", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_right2_1"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "normal_left3_1"}, "inbound_nodes": [[["normal_bn_1_1", 0, 0, {}]]], "name": "normal_left3_1"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "normal_left4_1"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "normal_left4_1"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "normal_right4_1"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "normal_right4_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_left5_1"}, "inbound_nodes": [[["separable_conv_2_normal_left5_1", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_left5_1"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_1_1"}, "inbound_nodes": [[["separable_conv_2_bn_normal_left1_1", 0, 0, {}], ["separable_conv_2_bn_normal_right1_1", 0, 0, {}]]], "name": "normal_add_1_1"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_2_1"}, "inbound_nodes": [[["separable_conv_2_bn_normal_left2_1", 0, 0, {}], ["separable_conv_2_bn_normal_right2_1", 0, 0, {}]]], "name": "normal_add_2_1"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_3_1"}, "inbound_nodes": [[["normal_left3_1", 0, 0, {}], ["stem_bn1", 0, 0, {}]]], "name": "normal_add_3_1"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_4_1"}, "inbound_nodes": [[["normal_left4_1", 0, 0, {}], ["normal_right4_1", 0, 0, {}]]], "name": "normal_add_4_1"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_5_1"}, "inbound_nodes": [[["separable_conv_2_bn_normal_left5_1", 0, 0, {}], ["normal_bn_1_1", 0, 0, {}]]], "name": "normal_add_5_1"}, {"class_name": "Concatenate", "config": {"axis": -1, "trainable": true, "name": "normal_concat_1"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}], ["normal_add_1_1", 0, 0, {}], ["normal_add_2_1", 0, 0, {}], ["normal_add_3_1", 0, 0, {}], ["normal_add_4_1", 0, 0, {}], ["normal_add_5_1", 0, 0, {}]]], "name": "normal_concat_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1304"}, "inbound_nodes": [[["normal_concat_0", 0, 0, {}]]], "name": "activation_1304"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1305"}, "inbound_nodes": [[["normal_concat_1", 0, 0, {}]]], "name": "activation_1305"}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "dilation_rate": [1, 1], "filters": 32, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "adjust_conv_projection_2", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_1304", 0, 0, {}]]], "name": "adjust_conv_projection_2"}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "dilation_rate": [1, 1], "filters": 32, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "normal_conv_1_2", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_1305", 0, 0, {}]]], "name": "normal_conv_1_2"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "adjust_bn_2"}, "inbound_nodes": [[["adjust_conv_projection_2", 0, 0, {}]]], "name": "adjust_bn_2"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "normal_bn_1_2"}, "inbound_nodes": [[["normal_conv_1_2", 0, 0, {}]]], "name": "normal_bn_1_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1306"}, "inbound_nodes": [[["normal_bn_1_2", 0, 0, {}]]], "name": "activation_1306"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1308"}, "inbound_nodes": [[["adjust_bn_2", 0, 0, {}]]], "name": "activation_1308"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1310"}, "inbound_nodes": [[["adjust_bn_2", 0, 0, {}]]], "name": "activation_1310"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1312"}, "inbound_nodes": [[["adjust_bn_2", 0, 0, {}]]], "name": "activation_1312"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1314"}, "inbound_nodes": [[["normal_bn_1_2", 0, 0, {}]]], "name": "activation_1314"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left1_2", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, 