{"class_name": "Model", "config": {"input_layers": [["input_8", 0, 0]], "name": "NASNet", "output_layers": [["predictions", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "sparse": false, "dtype": "float32", "name": "input_8"}, "inbound_nodes": [], "name": "input_8"}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "stem_conv1", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["input_8", 0, 0, {}]]], "name": "stem_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "stem_bn1"}, "inbound_nodes": [[["stem_conv1", 0, 0, {}]]], "name": "stem_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_940"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_940"}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "dilation_rate": [1, 1], "filters": 32, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "normal_conv_1_0", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_940", 0, 0, {}]]], "name": "normal_conv_1_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "normal_bn_1_0"}, "inbound_nodes": [[["normal_conv_1_0", 0, 0, {}]]], "name": "normal_bn_1_0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_941"}, "inbound_nodes": [[["normal_bn_1_0", 0, 0, {}]]], "name": "activation_941"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_943"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_943"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_945"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_945"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_947"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_947"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_949"}, "inbound_nodes": [[["normal_bn_1_0", 0, 0, {}]]], "name": "activation_949"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left1_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_941", 0, 0, {}]]], "name": "separable_conv_1_normal_left1_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_right1_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_943", 0, 0, {}]]], "name": "separable_conv_1_normal_right1_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left2_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_945", 0, 0, {}]]], "name": "separable_conv_1_normal_left2_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_right2_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_947", 0, 0, {}]]], "name": "separable_conv_1_normal_right2_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left5_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_949", 0, 0, {}]]], "name": "separable_conv_1_normal_left5_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_left1_0"}, "inbound_nodes": [[["separable_conv_1_normal_left1_0", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_left1_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_right1_0"}, "inbound_nodes": [[["separable_conv_1_normal_right1_0", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_right1_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_left2_0"}, "inbound_nodes": [[["separable_conv_1_normal_left2_0", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_left2_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_right2_0"}, "inbound_nodes": [[["separable_conv_1_normal_right2_0", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_right2_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_left5_0"}, "inbound_nodes": [[["separable_conv_1_normal_left5_0", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_left5_0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_942"}, "inbound_nodes": [[["separable_conv_1_bn_normal_left1_0", 0, 0, {}]]], "name": "activation_942"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_944"}, "inbound_nodes": [[["separable_conv_1_bn_normal_right1_0", 0, 0, {}]]], "name": "activation_944"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_946"}, "inbound_nodes": [[["separable_conv_1_bn_normal_left2_0", 0, 0, {}]]], "name": "activation_946"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_948"}, "inbound_nodes": [[["separable_conv_1_bn_normal_right2_0", 0, 0, {}]]], "name": "activation_948"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_950"}, "inbound_nodes": [[["separable_conv_1_bn_normal_left5_0", 0, 0, {}]]], "name": "activation_950"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_left1_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_942", 0, 0, {}]]], "name": "separable_conv_2_normal_left1_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_right1_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_944", 0, 0, {}]]], "name": "separable_conv_2_normal_right1_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_left2_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_946", 0, 0, {}]]], "name": "separable_conv_2_normal_left2_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_right2_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_948", 0, 0, {}]]], "name": "separable_conv_2_normal_right2_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_left5_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_950", 0, 0, {}]]], "name": "separable_conv_2_normal_left5_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_left1_0"}, "inbound_nodes": [[["separable_conv_2_normal_left1_0", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_left1_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_right1_0"}, "inbound_nodes": [[["separable_conv_2_normal_right1_0", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_right1_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_left2_0"}, "inbound_nodes": [[["separable_conv_2_normal_left2_0", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_left2_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_right2_0"}, "inbound_nodes": [[["separable_conv_2_normal_right2_0", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_right2_0"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "normal_left3_0"}, "inbound_nodes": [[["normal_bn_1_0", 0, 0, {}]]], "name": "normal_left3_0"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "normal_left4_0"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "normal_left4_0"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "normal_right4_0"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "normal_right4_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_left5_0"}, "inbound_nodes": [[["separable_conv_2_normal_left5_0", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_left5_0"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_1_0"}, "inbound_nodes": [[["separable_conv_2_bn_normal_left1_0", 0, 0, {}], ["separable_conv_2_bn_normal_right1_0", 0, 0, {}]]], "name": "normal_add_1_0"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_2_0"}, "inbound_nodes": [[["separable_conv_2_bn_normal_left2_0", 0, 0, {}], ["separable_conv_2_bn_normal_right2_0", 0, 0, {}]]], "name": "normal_add_2_0"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_3_0"}, "inbound_nodes": [[["normal_left3_0", 0, 0, {}], ["stem_bn1", 0, 0, {}]]], "name": "normal_add_3_0"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_4_0"}, "inbound_nodes": [[["normal_left4_0", 0, 0, {}], ["normal_right4_0", 0, 0, {}]]], "name": "normal_add_4_0"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_5_0"}, "inbound_nodes": [[["separable_conv_2_bn_normal_left5_0", 0, 0, {}], ["normal_bn_1_0", 0, 0, {}]]], "name": "normal_add_5_0"}, {"class_name": "Concatenate", "config": {"axis": -1, "trainable": true, "name": "normal_concat_0"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}], ["normal_add_1_0", 0, 0, {}], ["normal_add_2_0", 0, 0, {}], ["normal_add_3_0", 0, 0, {}], ["normal_add_4_0", 0, 0, {}], ["normal_add_5_0", 0, 0, {}]]], "name": "normal_concat_0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_951"}, "inbound_nodes": [[["normal_concat_0", 0, 0, {}]]], "name": "activation_951"}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "dilation_rate": [1, 1], "filters": 32, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "normal_conv_1_1", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_951", 0, 0, {}]]], "name": "normal_conv_1_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "normal_bn_1_1"}, "inbound_nodes": [[["normal_conv_1_1", 0, 0, {}]]], "name": "normal_bn_1_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_952"}, "inbound_nodes": [[["normal_bn_1_1", 0, 0, {}]]], "name": "activation_952"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_954"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_954"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_956"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_956"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_958"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_958"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_960"}, "inbound_nodes": [[["normal_bn_1_1", 0, 0, {}]]], "name": "activation_960"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left1_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_952", 0, 0, {}]]], "name": "separable_conv_1_normal_left1_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_right1_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_954", 0, 0, {}]]], "name": "separable_conv_1_normal_right1_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left2_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_956", 0, 0, {}]]], "name": "separable_conv_1_normal_left2_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_right2_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_958", 0, 0, {}]]], "name": "separable_conv_1_normal_right2_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left5_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_960", 0, 0, {}]]], "name": "separable_conv_1_normal_left5_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_left1_1"}, "inbound_nodes": [[["separable_conv_1_normal_left1_1", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_left1_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_right1_1"}, "inbound_nodes": [[["separable_conv_1_normal_right1_1", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_right1_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_left2_1"}, "inbound_nodes": [[["separable_conv_1_normal_left2_1", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_left2_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_right2_1"}, "inbound_nodes": [[["separable_conv_1_normal_right2_1", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_right2_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_left5_1"}, "inbound_nodes": [[["separable_conv_1_normal_left5_1", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_left5_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_953"}, "inbound_nodes": [[["separable_conv_1_bn_normal_left1_1", 0, 0, {}]]], "name": "activation_953"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_955"}, "inbound_nodes": [[["separable_conv_1_bn_normal_right1_1", 0, 0, {}]]], "name": "activation_955"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_957"}, "inbound_nodes": [[["separable_conv_1_bn_normal_left2_1", 0, 0, {}]]], "name": "activation_957"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_959"}, "inbound_nodes": [[["separable_conv_1_bn_normal_right2_1", 0, 0, {}]]], "name": "activation_959"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_961"}, "inbound_nodes": [[["separable_conv_1_bn_normal_left5_1", 0, 0, {}]]], "name": "activation_961"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_left1_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_953", 0, 0, {}]]], "name": "separable_conv_2_normal_left1_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_right1_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_955", 0, 0, {}]]], "name": "separable_conv_2_normal_right1_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_left2_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_957", 0, 0, {}]]], "name": "separable_conv_2_normal_left2_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_right2_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_959", 0, 0, {}]]], "name": "separable_conv_2_normal_right2_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_left5_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_961", 0, 0, {}]]], "name": "separable_conv_2_normal_left5_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_left1_1"}, "inbound_nodes": [[["separable_conv_2_normal_left1_1", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_left1_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_right1_1"}, "inbound_nodes": [[["separable_conv_2_normal_right1_1", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_right1_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_left2_1"}, "inbound_nodes": [[["separable_conv_2_normal_left2_1", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_left2_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_right2_1"}, "inbound_nodes": [[["separable_conv_2_normal_right2_1", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_right2_1"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "normal_left3_1"}, "inbound_nodes": [[["normal_bn_1_1", 0, 0, {}]]], "name": "normal_left3_1"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "normal_left4_1"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "normal_left4_1"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "normal_right4_1"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "normal_right4_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_left5_1"}, "inbound_nodes": [[["separable_conv_2_normal_left5_1", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_left5_1"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_1_1"}, "inbound_nodes": [[["separable_conv_2_bn_normal_left1_1", 0, 0, {}], ["separable_conv_2_bn_normal_right1_1", 0, 0, {}]]], "name": "normal_add_1_1"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_2_1"}, "inbound_nodes": [[["separable_conv_2_bn_normal_left2_1", 0, 0, {}], ["separable_conv_2_bn_normal_right2_1", 0, 0, {}]]], "name": "normal_add_2_1"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_3_1"}, "inbound_nodes": [[["normal_left3_1", 0, 0, {}], ["stem_bn1", 0, 0, {}]]], "name": "normal_add_3_1"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_4_1"}, "inbound_nodes": [[["normal_left4_1", 0, 0, {}], ["normal_right4_1", 0, 0, {}]]], "name": "normal_add_4_1"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_5_1"}, "inbound_nodes": [[["separable_conv_2_bn_normal_left5_1", 0, 0, {}], ["normal_bn_1_1", 0, 0, {}]]], "name": "normal_add_5_1"}, {"class_name": "Concatenate", "config": {"axis": -1, "trainable": true, "name": "normal_concat_1"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}], ["normal_add_1_1", 0, 0, {}], ["normal_add_2_1", 0, 0, {}], ["normal_add_3_1", 0, 0, {}], ["normal_add_4_1", 0, 0, {}], ["normal_add_5_1", 0, 0, {}]]], "name": "normal_concat_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_962"}, "inbound_nodes": [[["normal_concat_0", 0, 0, {}]]], "name": "activation_962"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_963"}, "inbound_nodes": [[["normal_concat_1", 0, 0, {}]]], "name": "activation_963"}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "dilation_rate": [1, 1], "filters": 32, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "adjust_conv_projection_2", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_962", 0, 0, {}]]], "name": "adjust_conv_projection_2"}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "dilation_rate": [1, 1], "filters": 32, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "normal_conv_1_2", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_963", 0, 0, {}]]], "name": "normal_conv_1_2"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "adjust_bn_2"}, "inbound_nodes": [[["adjust_conv_projection_2", 0, 0, {}]]], "name": "adjust_bn_2"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "normal_bn_1_2"}, "inbound_nodes": [[["normal_conv_1_2", 0, 0, {}]]], "name": "normal_bn_1_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_964"}, "inbound_nodes": [[["normal_bn_1_2", 0, 0, {}]]], "name": "activation_964"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_966"}, "inbound_nodes": [[["adjust_bn_2", 0, 0, {}]]], "name": "activation_966"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_968"}, "inbound_nodes": [[["adjust_bn_2", 0, 0, {}]]], "name": "activation_968"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_970"}, "inbound_nodes": [[["adjust_bn_2", 0, 0, {}]]], "name": "activation_970"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_972"}, "inbound_nodes": [[["normal_bn_1_2", 0, 0, {}]]], "name": "activation_972"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left1_2", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, 