{"class_name": "Model", "config": {"input_layers": [["input_2", 0, 0]], "name": "NASNet", "output_layers": [["predictions", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "sparse": false, "dtype": "float32", "name": "input_2"}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "stem_conv1", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "stem_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "stem_bn1"}, "inbound_nodes": [[["stem_conv1", 0, 0, {}]]], "name": "stem_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_130"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_130"}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "dilation_rate": [1, 1], "filters": 32, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "normal_conv_1_0", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_130", 0, 0, {}]]], "name": "normal_conv_1_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "normal_bn_1_0"}, "inbound_nodes": [[["normal_conv_1_0", 0, 0, {}]]], "name": "normal_bn_1_0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_131"}, "inbound_nodes": [[["normal_bn_1_0", 0, 0, {}]]], "name": "activation_131"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_133"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_133"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_135"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_135"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_137"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_137"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_139"}, "inbound_nodes": [[["normal_bn_1_0", 0, 0, {}]]], "name": "activation_139"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left1_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_131", 0, 0, {}]]], "name": "separable_conv_1_normal_left1_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_right1_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_133", 0, 0, {}]]], "name": "separable_conv_1_normal_right1_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left2_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_135", 0, 0, {}]]], "name": "separable_conv_1_normal_left2_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_right2_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_137", 0, 0, {}]]], "name": "separable_conv_1_normal_right2_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left5_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_139", 0, 0, {}]]], "name": "separable_conv_1_normal_left5_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_left1_0"}, "inbound_nodes": [[["separable_conv_1_normal_left1_0", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_left1_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_right1_0"}, "inbound_nodes": [[["separable_conv_1_normal_right1_0", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_right1_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_left2_0"}, "inbound_nodes": [[["separable_conv_1_normal_left2_0", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_left2_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_right2_0"}, "inbound_nodes": [[["separable_conv_1_normal_right2_0", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_right2_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_left5_0"}, "inbound_nodes": [[["separable_conv_1_normal_left5_0", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_left5_0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_132"}, "inbound_nodes": [[["separable_conv_1_bn_normal_left1_0", 0, 0, {}]]], "name": "activation_132"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_134"}, "inbound_nodes": [[["separable_conv_1_bn_normal_right1_0", 0, 0, {}]]], "name": "activation_134"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_136"}, "inbound_nodes": [[["separable_conv_1_bn_normal_left2_0", 0, 0, {}]]], "name": "activation_136"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_138"}, "inbound_nodes": [[["separable_conv_1_bn_normal_right2_0", 0, 0, {}]]], "name": "activation_138"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_140"}, "inbound_nodes": [[["separable_conv_1_bn_normal_left5_0", 0, 0, {}]]], "name": "activation_140"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_left1_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_132", 0, 0, {}]]], "name": "separable_conv_2_normal_left1_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_right1_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_134", 0, 0, {}]]], "name": "separable_conv_2_normal_right1_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_left2_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_136", 0, 0, {}]]], "name": "separable_conv_2_normal_left2_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_right2_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_138", 0, 0, {}]]], "name": "separable_conv_2_normal_right2_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_left5_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_140", 0, 0, {}]]], "name": "separable_conv_2_normal_left5_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_left1_0"}, "inbound_nodes": [[["separable_conv_2_normal_left1_0", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_left1_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_right1_0"}, "inbound_nodes": [[["separable_conv_2_normal_right1_0", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_right1_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_left2_0"}, "inbound_nodes": [[["separable_conv_2_normal_left2_0", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_left2_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_right2_0"}, "inbound_nodes": [[["separable_conv_2_normal_right2_0", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_right2_0"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "normal_left3_0"}, "inbound_nodes": [[["normal_bn_1_0", 0, 0, {}]]], "name": "normal_left3_0"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "normal_left4_0"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "normal_left4_0"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "normal_right4_0"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "normal_right4_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_left5_0"}, "inbound_nodes": [[["separable_conv_2_normal_left5_0", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_left5_0"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_1_0"}, "inbound_nodes": [[["separable_conv_2_bn_normal_left1_0", 0, 0, {}], ["separable_conv_2_bn_normal_right1_0", 0, 0, {}]]], "name": "normal_add_1_0"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_2_0"}, "inbound_nodes": [[["separable_conv_2_bn_normal_left2_0", 0, 0, {}], ["separable_conv_2_bn_normal_right2_0", 0, 0, {}]]], "name": "normal_add_2_0"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_3_0"}, "inbound_nodes": [[["normal_left3_0", 0, 0, {}], ["stem_bn1", 0, 0, {}]]], "name": "normal_add_3_0"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_4_0"}, "inbound_nodes": [[["normal_left4_0", 0, 0, {}], ["normal_right4_0", 0, 0, {}]]], "name": "normal_add_4_0"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_5_0"}, "inbound_nodes": [[["separable_conv_2_bn_normal_left5_0", 0, 0, {}], ["normal_bn_1_0", 0, 0, {}]]], "name": "normal_add_5_0"}, {"class_name": "Concatenate", "config": {"axis": -1, "trainable": true, "name": "normal_concat_0"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}], ["normal_add_1_0", 0, 0, {}], ["normal_add_2_0", 0, 0, {}], ["normal_add_3_0", 0, 0, {}], ["normal_add_4_0", 0, 0, {}], ["normal_add_5_0", 0, 0, {}]]], "name": "normal_concat_0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_141"}, "inbound_nodes": [[["normal_concat_0", 0, 0, {}]]], "name": "activation_141"}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "dilation_rate": [1, 1], "filters": 32, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "normal_conv_1_1", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_141", 0, 0, {}]]], "name": "normal_conv_1_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "normal_bn_1_1"}, "inbound_nodes": [[["normal_conv_1_1", 0, 0, {}]]], "name": "normal_bn_1_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_142"}, "inbound_nodes": [[["normal_bn_1_1", 0, 0, {}]]], "name": "activation_142"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_144"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_144"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_146"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_146"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_148"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_148"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_150"}, "inbound_nodes": [[["normal_bn_1_1", 0, 0, {}]]], "name": "activation_150"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left1_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_142", 0, 0, {}]]], "name": "separable_conv_1_normal_left1_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_right1_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_144", 0, 0, {}]]], "name": "separable_conv_1_normal_right1_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left2_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_146", 0, 0, {}]]], "name": "separable_conv_1_normal_left2_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_right2_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_148", 0, 0, {}]]], "name": "separable_conv_1_normal_right2_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left5_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_150", 0, 0, {}]]], "name": "separable_conv_1_normal_left5_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_left1_1"}, "inbound_nodes": [[["separable_conv_1_normal_left1_1", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_left1_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_right1_1"}, "inbound_nodes": [[["separable_conv_1_normal_right1_1", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_right1_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_left2_1"}, "inbound_nodes": [[["separable_conv_1_normal_left2_1", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_left2_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_right2_1"}, "inbound_nodes": [[["separable_conv_1_normal_right2_1", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_right2_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_left5_1"}, "inbound_nodes": [[["separable_conv_1_normal_left5_1", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_left5_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_143"}, "inbound_nodes": [[["separable_conv_1_bn_normal_left1_1", 0, 0, {}]]], "name": "activation_143"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_145"}, "inbound_nodes": [[["separable_conv_1_bn_normal_right1_1", 0, 0, {}]]], "name": "activation_145"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_147"}, "inbound_nodes": [[["separable_conv_1_bn_normal_left2_1", 0, 0, {}]]], "name": "activation_147"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_149"}, "inbound_nodes": [[["separable_conv_1_bn_normal_right2_1", 0, 0, {}]]], "name": "activation_149"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_151"}, "inbound_nodes": [[["separable_conv_1_bn_normal_left5_1", 0, 0, {}]]], "name": "activation_151"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_left1_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_143", 0, 0, {}]]], "name": "separable_conv_2_normal_left1_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_right1_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_145", 0, 0, {}]]], "name": "separable_conv_2_normal_right1_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_left2_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_147", 0, 0, {}]]], "name": "separable_conv_2_normal_left2_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_right2_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_149", 0, 0, {}]]], "name": "separable_conv_2_normal_right2_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_left5_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_151", 0, 0, {}]]], "name": "separable_conv_2_normal_left5_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_left1_1"}, "inbound_nodes": [[["separable_conv_2_normal_left1_1", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_left1_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_right1_1"}, "inbound_nodes": [[["separable_conv_2_normal_right1_1", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_right1_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_left2_1"}, "inbound_nodes": [[["separable_conv_2_normal_left2_1", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_left2_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_right2_1"}, "inbound_nodes": [[["separable_conv_2_normal_right2_1", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_right2_1"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "normal_left3_1"}, "inbound_nodes": [[["normal_bn_1_1", 0, 0, {}]]], "name": "normal_left3_1"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "normal_left4_1"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "normal_left4_1"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "normal_right4_1"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "normal_right4_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_left5_1"}, "inbound_nodes": [[["separable_conv_2_normal_left5_1", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_left5_1"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_1_1"}, "inbound_nodes": [[["separable_conv_2_bn_normal_left1_1", 0, 0, {}], ["separable_conv_2_bn_normal_right1_1", 0, 0, {}]]], "name": "normal_add_1_1"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_2_1"}, "inbound_nodes": [[["separable_conv_2_bn_normal_left2_1", 0, 0, {}], ["separable_conv_2_bn_normal_right2_1", 0, 0, {}]]], "name": "normal_add_2_1"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_3_1"}, "inbound_nodes": [[["normal_left3_1", 0, 0, {}], ["stem_bn1", 0, 0, {}]]], "name": "normal_add_3_1"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_4_1"}, "inbound_nodes": [[["normal_left4_1", 0, 0, {}], ["normal_right4_1", 0, 0, {}]]], "name": "normal_add_4_1"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_5_1"}, "inbound_nodes": [[["separable_conv_2_bn_normal_left5_1", 0, 0, {}], ["normal_bn_1_1", 0, 0, {}]]], "name": "normal_add_5_1"}, {"class_name": "Concatenate", "config": {"axis": -1, "trainable": true, "name": "normal_concat_1"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}], ["normal_add_1_1", 0, 0, {}], ["normal_add_2_1", 0, 0, {}], ["normal_add_3_1", 0, 0, {}], ["normal_add_4_1", 0, 0, {}], ["normal_add_5_1", 0, 0, {}]]], "name": "normal_concat_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_153"}, "inbound_nodes": [[["normal_concat_1", 0, 0, {}]]], "name": "activation_153"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_152"}, "inbound_nodes": [[["normal_concat_0", 0, 0, {}]]], "name": "activation_152"}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "dilation_rate": [1, 1], "filters": 64, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "reduction_conv_1_reduce_2", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_153", 0, 0, {}]]], "name": "reduction_conv_1_reduce_2"}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "dilation_rate": [1, 1], "filters": 64, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "adjust_conv_projection_reduce_2", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_152", 0, 0, {}]]], "name": "adjust_conv_projection_reduce_2"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "reduction_bn_1_reduce_2"}, "inbound_nodes": [[["reduction_conv_1_reduce_2", 0, 0, {}]]], "name": "reduction_bn_1_reduce_2"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "adjust_bn_reduce_2"}, "inbound_nodes": [[["adjust_conv_projection_reduce_2", 0, 0, {}]]], "name": "adjust_bn_reduce_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_154"}, "inbound_nodes": [[["reduction_bn_1_reduce_2", 0, 0, {}]]], "name": "activation_154"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_156"}, "inbound_nodes": [[["adjust_bn_reduce_2", 0, 0, {}]]], "name": "activation_156"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [2, 2], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_reduction_left1_reduce_2", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_154", 0, 0, {}]]], "name": "separable_conv_1_reduction_left1_reduce_2"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [7, 7], "dilation_rate": [1, 1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, 