{"class_name": "Model", "config": {"input_layers": [["input_6", 0, 0]], "name": "NASNet", "output_layers": [["predictions", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "sparse": false, "dtype": "float32", "name": "input_6"}, "inbound_nodes": [], "name": "input_6"}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "stem_conv1", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["input_6", 0, 0, {}]]], "name": "stem_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "stem_bn1"}, "inbound_nodes": [[["stem_conv1", 0, 0, {}]]], "name": "stem_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_646"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_646"}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "dilation_rate": [1, 1], "filters": 32, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "normal_conv_1_0", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_646", 0, 0, {}]]], "name": "normal_conv_1_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "normal_bn_1_0"}, "inbound_nodes": [[["normal_conv_1_0", 0, 0, {}]]], "name": "normal_bn_1_0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_647"}, "inbound_nodes": [[["normal_bn_1_0", 0, 0, {}]]], "name": "activation_647"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_649"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_649"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_651"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_651"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_653"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_653"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_655"}, "inbound_nodes": [[["normal_bn_1_0", 0, 0, {}]]], "name": "activation_655"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left1_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_647", 0, 0, {}]]], "name": "separable_conv_1_normal_left1_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_right1_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_649", 0, 0, {}]]], "name": "separable_conv_1_normal_right1_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left2_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_651", 0, 0, {}]]], "name": "separable_conv_1_normal_left2_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_right2_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_653", 0, 0, {}]]], "name": "separable_conv_1_normal_right2_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left5_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_655", 0, 0, {}]]], "name": "separable_conv_1_normal_left5_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_left1_0"}, "inbound_nodes": [[["separable_conv_1_normal_left1_0", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_left1_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_right1_0"}, "inbound_nodes": [[["separable_conv_1_normal_right1_0", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_right1_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_left2_0"}, "inbound_nodes": [[["separable_conv_1_normal_left2_0", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_left2_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_right2_0"}, "inbound_nodes": [[["separable_conv_1_normal_right2_0", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_right2_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_left5_0"}, "inbound_nodes": [[["separable_conv_1_normal_left5_0", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_left5_0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_648"}, "inbound_nodes": [[["separable_conv_1_bn_normal_left1_0", 0, 0, {}]]], "name": "activation_648"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_650"}, "inbound_nodes": [[["separable_conv_1_bn_normal_right1_0", 0, 0, {}]]], "name": "activation_650"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_652"}, "inbound_nodes": [[["separable_conv_1_bn_normal_left2_0", 0, 0, {}]]], "name": "activation_652"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_654"}, "inbound_nodes": [[["separable_conv_1_bn_normal_right2_0", 0, 0, {}]]], "name": "activation_654"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_656"}, "inbound_nodes": [[["separable_conv_1_bn_normal_left5_0", 0, 0, {}]]], "name": "activation_656"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_left1_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_648", 0, 0, {}]]], "name": "separable_conv_2_normal_left1_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_right1_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_650", 0, 0, {}]]], "name": "separable_conv_2_normal_right1_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_left2_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_652", 0, 0, {}]]], "name": "separable_conv_2_normal_left2_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_right2_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_654", 0, 0, {}]]], "name": "separable_conv_2_normal_right2_0"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_left5_0", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_656", 0, 0, {}]]], "name": "separable_conv_2_normal_left5_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_left1_0"}, "inbound_nodes": [[["separable_conv_2_normal_left1_0", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_left1_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_right1_0"}, "inbound_nodes": [[["separable_conv_2_normal_right1_0", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_right1_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_left2_0"}, "inbound_nodes": [[["separable_conv_2_normal_left2_0", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_left2_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_right2_0"}, "inbound_nodes": [[["separable_conv_2_normal_right2_0", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_right2_0"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "normal_left3_0"}, "inbound_nodes": [[["normal_bn_1_0", 0, 0, {}]]], "name": "normal_left3_0"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "normal_left4_0"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "normal_left4_0"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "normal_right4_0"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "normal_right4_0"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_left5_0"}, "inbound_nodes": [[["separable_conv_2_normal_left5_0", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_left5_0"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_1_0"}, "inbound_nodes": [[["separable_conv_2_bn_normal_left1_0", 0, 0, {}], ["separable_conv_2_bn_normal_right1_0", 0, 0, {}]]], "name": "normal_add_1_0"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_2_0"}, "inbound_nodes": [[["separable_conv_2_bn_normal_left2_0", 0, 0, {}], ["separable_conv_2_bn_normal_right2_0", 0, 0, {}]]], "name": "normal_add_2_0"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_3_0"}, "inbound_nodes": [[["normal_left3_0", 0, 0, {}], ["stem_bn1", 0, 0, {}]]], "name": "normal_add_3_0"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_4_0"}, "inbound_nodes": [[["normal_left4_0", 0, 0, {}], ["normal_right4_0", 0, 0, {}]]], "name": "normal_add_4_0"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_5_0"}, "inbound_nodes": [[["separable_conv_2_bn_normal_left5_0", 0, 0, {}], ["normal_bn_1_0", 0, 0, {}]]], "name": "normal_add_5_0"}, {"class_name": "Concatenate", "config": {"axis": -1, "trainable": true, "name": "normal_concat_0"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}], ["normal_add_1_0", 0, 0, {}], ["normal_add_2_0", 0, 0, {}], ["normal_add_3_0", 0, 0, {}], ["normal_add_4_0", 0, 0, {}], ["normal_add_5_0", 0, 0, {}]]], "name": "normal_concat_0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_657"}, "inbound_nodes": [[["normal_concat_0", 0, 0, {}]]], "name": "activation_657"}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "dilation_rate": [1, 1], "filters": 32, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "normal_conv_1_1", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_657", 0, 0, {}]]], "name": "normal_conv_1_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "normal_bn_1_1"}, "inbound_nodes": [[["normal_conv_1_1", 0, 0, {}]]], "name": "normal_bn_1_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_658"}, "inbound_nodes": [[["normal_bn_1_1", 0, 0, {}]]], "name": "activation_658"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_660"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_660"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_662"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_662"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_664"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_664"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_666"}, "inbound_nodes": [[["normal_bn_1_1", 0, 0, {}]]], "name": "activation_666"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left1_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_658", 0, 0, {}]]], "name": "separable_conv_1_normal_left1_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_right1_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_660", 0, 0, {}]]], "name": "separable_conv_1_normal_right1_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left2_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_662", 0, 0, {}]]], "name": "separable_conv_1_normal_left2_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_right2_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_664", 0, 0, {}]]], "name": "separable_conv_1_normal_right2_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left5_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_666", 0, 0, {}]]], "name": "separable_conv_1_normal_left5_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_left1_1"}, "inbound_nodes": [[["separable_conv_1_normal_left1_1", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_left1_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_right1_1"}, "inbound_nodes": [[["separable_conv_1_normal_right1_1", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_right1_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_left2_1"}, "inbound_nodes": [[["separable_conv_1_normal_left2_1", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_left2_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_right2_1"}, "inbound_nodes": [[["separable_conv_1_normal_right2_1", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_right2_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_1_bn_normal_left5_1"}, "inbound_nodes": [[["separable_conv_1_normal_left5_1", 0, 0, {}]]], "name": "separable_conv_1_bn_normal_left5_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_659"}, "inbound_nodes": [[["separable_conv_1_bn_normal_left1_1", 0, 0, {}]]], "name": "activation_659"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_661"}, "inbound_nodes": [[["separable_conv_1_bn_normal_right1_1", 0, 0, {}]]], "name": "activation_661"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_663"}, "inbound_nodes": [[["separable_conv_1_bn_normal_left2_1", 0, 0, {}]]], "name": "activation_663"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_665"}, "inbound_nodes": [[["separable_conv_1_bn_normal_right2_1", 0, 0, {}]]], "name": "activation_665"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_667"}, "inbound_nodes": [[["separable_conv_1_bn_normal_left5_1", 0, 0, {}]]], "name": "activation_667"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_left1_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_659", 0, 0, {}]]], "name": "separable_conv_2_normal_left1_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_right1_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_661", 0, 0, {}]]], "name": "separable_conv_2_normal_right1_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_left2_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_663", 0, 0, {}]]], "name": "separable_conv_2_normal_left2_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_right2_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_665", 0, 0, {}]]], "name": "separable_conv_2_normal_right2_1"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_2_normal_left5_1", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["activation_667", 0, 0, {}]]], "name": "separable_conv_2_normal_left5_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_left1_1"}, "inbound_nodes": [[["separable_conv_2_normal_left1_1", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_left1_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_right1_1"}, "inbound_nodes": [[["separable_conv_2_normal_right1_1", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_right1_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_left2_1"}, "inbound_nodes": [[["separable_conv_2_normal_left2_1", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_left2_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_right2_1"}, "inbound_nodes": [[["separable_conv_2_normal_right2_1", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_right2_1"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "normal_left3_1"}, "inbound_nodes": [[["normal_bn_1_1", 0, 0, {}]]], "name": "normal_left3_1"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "normal_left4_1"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "normal_left4_1"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "normal_right4_1"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "normal_right4_1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "separable_conv_2_bn_normal_left5_1"}, "inbound_nodes": [[["separable_conv_2_normal_left5_1", 0, 0, {}]]], "name": "separable_conv_2_bn_normal_left5_1"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_1_1"}, "inbound_nodes": [[["separable_conv_2_bn_normal_left1_1", 0, 0, {}], ["separable_conv_2_bn_normal_right1_1", 0, 0, {}]]], "name": "normal_add_1_1"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_2_1"}, "inbound_nodes": [[["separable_conv_2_bn_normal_left2_1", 0, 0, {}], ["separable_conv_2_bn_normal_right2_1", 0, 0, {}]]], "name": "normal_add_2_1"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_3_1"}, "inbound_nodes": [[["normal_left3_1", 0, 0, {}], ["stem_bn1", 0, 0, {}]]], "name": "normal_add_3_1"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_4_1"}, "inbound_nodes": [[["normal_left4_1", 0, 0, {}], ["normal_right4_1", 0, 0, {}]]], "name": "normal_add_4_1"}, {"class_name": "Add", "config": {"trainable": true, "name": "normal_add_5_1"}, "inbound_nodes": [[["separable_conv_2_bn_normal_left5_1", 0, 0, {}], ["normal_bn_1_1", 0, 0, {}]]], "name": "normal_add_5_1"}, {"class_name": "Concatenate", "config": {"axis": -1, "trainable": true, "name": "normal_concat_1"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}], ["normal_add_1_1", 0, 0, {}], ["normal_add_2_1", 0, 0, {}], ["normal_add_3_1", 0, 0, {}], ["normal_add_4_1", 0, 0, {}], ["normal_add_5_1", 0, 0, {}]]], "name": "normal_concat_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_668"}, "inbound_nodes": [[["normal_concat_0", 0, 0, {}]]], "name": "activation_668"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_669"}, "inbound_nodes": [[["normal_concat_1", 0, 0, {}]]], "name": "activation_669"}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "dilation_rate": [1, 1], "filters": 32, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "adjust_conv_projection_2", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_668", 0, 0, {}]]], "name": "adjust_conv_projection_2"}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "dilation_rate": [1, 1], "filters": 32, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "normal_conv_1_2", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_669", 0, 0, {}]]], "name": "normal_conv_1_2"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "adjust_bn_2"}, "inbound_nodes": [[["adjust_conv_projection_2", 0, 0, {}]]], "name": "adjust_bn_2"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9, "name": "normal_bn_1_2"}, "inbound_nodes": [[["normal_conv_1_2", 0, 0, {}]]], "name": "normal_bn_1_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_670"}, "inbound_nodes": [[["normal_bn_1_2", 0, 0, {}]]], "name": "activation_670"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_672"}, "inbound_nodes": [[["adjust_bn_2", 0, 0, {}]]], "name": "activation_672"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_674"}, "inbound_nodes": [[["adjust_bn_2", 0, 0, {}]]], "name": "activation_674"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_676"}, "inbound_nodes": [[["adjust_bn_2", 0, 0, {}]]], "name": "activation_676"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_678"}, "inbound_nodes": [[["normal_bn_1_2", 0, 0, {}]]], "name": "activation_678"}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "separable_conv_1_normal_left1_2", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "pointwise_constraint": null, 