{"backend": "tensorflow", "keras_version": "2.1.2", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "sparse": false, "name": "input_1", "dtype": "float32"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "Conv2D_", "class_name": "Conv2D", "config": {"padding": "same", "strides": [1, 1], "filters": 16, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "name": "Conv2D_", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["Conv2D_", 0, 0, {}]]], "name": "BatchNorm1_", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "trainable": true, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "BatchNorm1_", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99}}, {"inbound_nodes": [[["BatchNorm1_", 0, 0, {}]]], "name": "Act1_", "class_name": "Activation", "config": {"name": "Act1_", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["Act1_", 0, 0, {}]]], "name": "Conv2D_0_0_0_1", "class_name": "Conv2D", "config": {"padding": "same", "strides": [1, 1], "filters": 16, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "name": "Conv2D_0_0_0_1", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["Conv2D_0_0_0_1", 0, 0, {}]]], "name": "BatchNorm1_0_0_0_1", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "trainable": true, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "BatchNorm1_0_0_0_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99}}, {"inbound_nodes": [[["BatchNorm1_0_0_0_1", 0, 0, {}]]], "name": "Act1_0_0_0_1", "class_name": "Activation", "config": {"name": "Act1_0_0_0_1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["Act1_0_0_0_1", 0, 0, {}]]], "name": "Conv2D_0_0_0_2", "class_name": "Conv2D", "config": {"padding": "same", "strides": [1, 1], "filters": 16, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "name": "Conv2D_0_0_0_2", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["Conv2D_0_0_0_2", 0, 0, {}]]], "name": "BatchNorm1_0_0_0_2", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "trainable": true, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "BatchNorm1_0_0_0_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99}}, {"inbound_nodes": [[["Act1_", 0, 0, {}], ["BatchNorm1_0_0_0_2", 0, 0, {}]]], "name": "Add_0_0_0", "class_name": "Add", "config": {"name": "Add_0_0_0", "trainable": true}}, {"inbound_nodes": [[["Add_0_0_0", 0, 0, {}]]], "name": "Actoutput0_0_0", "class_name": "Activation", "config": {"name": "Actoutput0_0_0", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["Actoutput0_0_0", 0, 0, {}]]], "name": "Conv2D_0_1_0_1", "class_name": "Conv2D", "config": {"padding": "same", "strides": [1, 1], "filters": 16, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "name": "Conv2D_0_1_0_1", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["Conv2D_0_1_0_1", 0, 0, {}]]], "name": "BatchNorm1_0_1_0_1", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "trainable": true, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "BatchNorm1_0_1_0_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99}}, {"inbound_nodes": [[["BatchNorm1_0_1_0_1", 0, 0, {}]]], "name": "Act1_0_1_0_1", "class_name": "Activation", "config": {"name": "Act1_0_1_0_1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["Act1_0_1_0_1", 0, 0, {}]]], "name": "Conv2D_0_1_0_2", "class_name": "Conv2D", "config": {"padding": "same", "strides": [1, 1], "filters": 16, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "name": "Conv2D_0_1_0_2", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["Conv2D_0_1_0_2", 0, 0, {}]]], "name": "BatchNorm1_0_1_0_2", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "trainable": true, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "BatchNorm1_0_1_0_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99}}, {"inbound_nodes": [[["Actoutput0_0_0", 0, 0, {}], ["BatchNorm1_0_1_0_2", 0, 0, {}]]], "name": "Add_0_1_0", "class_name": "Add", "config": {"name": "Add_0_1_0", "trainable": true}}, {"inbound_nodes": [[["Add_0_1_0", 0, 0, {}]]], "name": "Actoutput0_1_0", "class_name": "Activation", "config": {"name": "Actoutput0_1_0", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["Actoutput0_1_0", 0, 0, {}]]], "name": "Conv2D_0_2_0_1", "class_name": "Conv2D", "config": {"padding": "same", "strides": [1, 1], "filters": 16, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "name": "Conv2D_0_2_0_1", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["Conv2D_0_2_0_1", 0, 0, {}]]], "name": "BatchNorm1_0_2_0_1", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "trainable": true, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "BatchNorm1_0_2_0_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99}}, {"inbound_nodes": [[["BatchNorm1_0_2_0_1", 0, 0, {}]]], "name": "Act1_0_2_0_1", "class_name": "Activation", "config": {"name": "Act1_0_2_0_1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["Act1_0_2_0_1", 0, 0, {}]]], "name": "Conv2D_0_2_0_2", "class_name": "Conv2D", "config": {"padding": "same", "strides": [1, 1], "filters": 16, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "name": "Conv2D_0_2_0_2", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["Conv2D_0_2_0_2", 0, 0, {}]]], "name": "BatchNorm1_0_2_0_2", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "trainable": true, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "BatchNorm1_0_2_0_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99}}, {"inbound_nodes": [[["Actoutput0_1_0", 0, 0, {}], ["BatchNorm1_0_2_0_2", 0, 0, {}]]], "name": "Add_0_2_0", "class_name": "Add", "config": {"name": "Add_0_2_0", "trainable": true}}, {"inbound_nodes": [[["Add_0_2_0", 0, 0, {}]]], "name": "Actoutput0_2_0", "class_name": "Activation", "config": {"name": "Actoutput0_2_0", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["Actoutput0_2_0", 0, 0, {}]]], "name": "Conv2D_0_3_0_1", "class_name": "Conv2D", "config": {"padding": "same", "strides": [1, 1], "filters": 16, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "name": "Conv2D_0_3_0_1", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["Conv2D_0_3_0_1", 0, 0, {}]]], "name": "BatchNorm1_0_3_0_1", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "trainable": true, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "BatchNorm1_0_3_0_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99}}, {"inbound_nodes": [[["BatchNorm1_0_3_0_1", 0, 0, {}]]], "name": "Act1_0_3_0_1", "class_name": "Activation", "config": {"name": "Act1_0_3_0_1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["Act1_0_3_0_1", 0, 0, {}]]], "name": "Conv2D_0_3_0_2", "class_name": "Conv2D", "config": {"padding": "same", "strides": [1, 1], "filters": 16, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "name": "Conv2D_0_3_0_2", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["Conv2D_0_3_0_2", 0, 0, {}]]], "name": "BatchNorm1_0_3_0_2", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "trainable": true, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "BatchNorm1_0_3_0_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99}}, {"inbound_nodes": [[["Actoutput0_2_0", 0, 0, {}], ["BatchNorm1_0_3_0_2", 0, 0, {}]]], "name": "Add_0_3_0", "class_name": "Add", "config": {"name": "Add_0_3_0", "trainable": true}}, {"inbound_nodes": [[["Add_0_3_0", 0, 0, {}]]], "name": "Actoutput0_3_0", "class_name": "Activation", "config": {"name": "Actoutput0_3_0", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["Actoutput0_3_0", 0, 0, {}]]], "name": "Conv2D_0_4_0_1", "class_name": "Conv2D", "config": {"padding": "same", "strides": [1, 1], "filters": 16, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "name": "Conv2D_0_4_0_1", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["Conv2D_0_4_0_1", 0, 0, {}]]], "name": "BatchNorm1_0_4_0_1", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "trainable": true, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "BatchNorm1_0_4_0_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99}}, {"inbound_nodes": [[["BatchNorm1_0_4_0_1", 0, 0, {}]]], "name": "Act1_0_4_0_1", "class_name": "Activation", "config": {"name": "Act1_0_4_0_1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["Act1_0_4_0_1", 0, 0, {}]]], "name": "Conv2D_0_4_0_2", "class_name": "Conv2D", "config": {"padding": "same", "strides": [1, 1], "filters": 16, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "name": "Conv2D_0_4_0_2", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["Conv2D_0_4_0_2", 0, 0, {}]]], "name": "BatchNorm1_0_4_0_2", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "trainable": true, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "BatchNorm1_0_4_0_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99}}, {"inbound_nodes": [[["Actoutput0_3_0", 0, 0, {}], ["BatchNorm1_0_4_0_2", 0, 0, {}]]], "name": "Add_0_4_0", "class_name": "Add", "config": {"name": "Add_0_4_0", "trainable": true}}, {"inbound_nodes": [[["Add_0_4_0", 0, 0, {}]]], "name": "Actoutput0_4_0", "class_name": "Activation", "config": {"name": "Actoutput0_4_0", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["Actoutput0_4_0", 0, 0, {}]]], "name": "Conv2D_0_5_0_1", "class_name": "Conv2D", "config": {"padding": "same", "strides": [1, 1], "filters": 16, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "name": "Conv2D_0_5_0_1", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["Conv2D_0_5_0_1", 0, 0, {}]]], "name": "BatchNorm1_0_5_0_1", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "trainable": true, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "BatchNorm1_0_5_0_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99}}, {"inbound_nodes": [[["BatchNorm1_0_5_0_1", 0, 0, {}]]], "name": "Act1_0_5_0_1", "class_name": "Activation", "config": {"name": "Act1_0_5_0_1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["Act1_0_5_0_1", 0, 0, {}]]], "name": "Conv2D_0_5_0_2", "class_name": "Conv2D", "config": {"padding": "same", "strides": [1, 1], "filters": 16, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "name": "Conv2D_0_5_0_2", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["Conv2D_0_5_0_2", 0, 0, {}]]], "name": "BatchNorm1_0_5_0_2", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "trainable": true, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "BatchNorm1_0_5_0_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99}}, {"inbound_nodes": [[["Actoutput0_4_0", 0, 0, {}], ["BatchNorm1_0_5_0_2", 0, 0, {}]]], "name": "Add_0_5_0", "class_name": "Add", "config": {"name": "Add_0_5_0", "trainable": true}}, {"inbound_nodes": [[["Add_0_5_0", 0, 0, {}]]], "name": "Actoutput0_5_0", "class_name": "Activation", "config": {"name": "Actoutput0_5_0", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["Actoutput0_5_0", 0, 0, {}]]], "name": "Conv2D_1_0_0_1", "class_name": "Conv2D", "config": {"padding": "same", "strides": [2, 2], "filters": 32, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "name": "Conv2D_1_0_0_1", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["Conv2D_1_0_0_1", 0, 0, {}]]], "name": "BatchNorm1_1_0_0_1", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "trainable": true, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "BatchNorm1_1_0_0_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99}}, {"inbound_nodes": [[["BatchNorm1_1_0_0_1", 0, 0, {}]]], "name": "Act1_1_0_0_1", "class_name": "Activation", "config": {"name": "Act1_1_0_0_1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["Act1_1_0_0_1", 0, 0, {}]]], "name": "Conv2D_1_0_0_2", "class_name": "Conv2D", "config": {"padding": "same", "strides": [1, 1], "filters": 32, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "name": "Conv2D_1_0_0_2", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["Actoutput0_5_0", 0, 0, {}]]], "name": "Conv2D_1_0_0_3", "class_name": "Conv2D", "config": {"padding": "same", "strides": [2, 2], "filters": 32, "kernel_size": [1, 1], "trainable": true, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "name": "Conv2D_1_0_0_3", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["Conv2D_1_0_0_2", 0, 0, {}]]], "name": "BatchNorm1_1_0_0_2", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "trainable": true, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "BatchNorm1_1_0_0_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99}}, {"inbound_nodes": [[["Conv2D_1_0_0_3", 0, 0, {}], ["BatchNorm1_1_0_0_2", 0, 0, {}]]], "name": "Add_1_0_0", "class_name": "Add", "config": {"name": "Add_1_0_0", "trainable": true}}, {"inbound_nodes": [[["Add_1_0_0", 0, 0, {}]]], "name": "Actoutput1_0_0", "class_name": "Activation", "config": {"name": "Actoutput1_0_0", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["Actoutput1_0_0", 0, 0, {}]]], "name": "Conv2D_1_1_0_1", "class_name": "Conv2D", "config": {"padding": "same", "strides": [1, 1], "filters": 32, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "name": "Conv2D_1_1_0_1", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["Conv2D_1_1_0_1", 0, 0, {}]]], "name": "BatchNorm1_1_1_0_1", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "trainable": true, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "BatchNorm1_1_1_0_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99}}, {"inbound_nodes": [[["BatchNorm1_1_1_0_1", 0, 0, {}]]], "name": "Act1_1_1_0_1", "class_name": "Activation", "config": {"name": "Act1_1_1_0_1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["Act1_1_1_0_1", 0, 0, {}]]], "name": "Conv2D_1_1_0_2", "class_name": "Conv2D", "config": {"padding": "same", "strides": [1, 1], "filters": 32, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "name": "Conv2D_1_1_0_2", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["Conv2D_1_1_0_2", 0, 0, {}]]], "name": "BatchNorm1_1_1_0_2", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "trainable": true, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "BatchNorm1_1_1_0_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99}}, {"inbound_nodes": [[["Actoutput1_0_0", 0, 0, {}], ["BatchNorm1_1_1_0_2", 0, 0, {}]]], "name": "Add_1_1_0", "class_name": "Add", "config": {"name": "Add_1_1_0", "trainable": true}}, {"inbound_nodes": [[["Add_1_1_0", 0, 0, {}]]], "name": "Actoutput1_1_0", "class_name": "Activation", "config": {"name": "Actoutput1_1_0", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["Actoutput1_1_0", 0, 0, {}]]], "name": "Conv2D_1_2_0_1", "class_name": "Conv2D", "config": {"padding": "same", "strides": [1, 1], "filters": 32, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "name": "Conv2D_1_2_0_1", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["Conv2D_1_2_0_1", 0, 0, {}]]], "name": "BatchNorm1_1_2_0_1", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "trainable": true, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "BatchNorm1_1_2_0_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99}}, {"inbound_nodes": [[["BatchNorm1_1_2_0_1", 0, 0, {}]]], "name": "Act1_1_2_0_1", "class_name": "Activation", "config": {"name": "Act1_1_2_0_1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["Act1_1_2_0_1", 0, 0, {}]]], "name": "Conv2D_1_2_0_2", "class_name": "Conv2D", "config": {"padding": "same", "strides": [1, 1], "filters": 32, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "name": "Conv2D_1_2_0_2", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["Conv2D_1_2_0_2", 0, 0, {}]]], "name": "BatchNorm1_1_2_0_2", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "trainable": true, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "BatchNorm1_1_2_0_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99}}, {"inbound_nodes": [[["Actoutput1_1_0", 0, 0, {}], ["BatchNorm1_1_2_0_2", 0, 0, {}]]], "name": "Add_1_2_0", "class_name": "Add", "config": {"name": "Add_1_2_0", "trainable": true}}, {"inbound_nodes": [[["Add_1_2_0", 0, 0, {}]]], "name": "Actoutput1_2_0", "class_name": "Activation", "config": {"name": "Actoutput1_2_0", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["Actoutput1_2_0", 0, 0, {}]]], "name": "Conv2D_1_3_0_1", "class_name": "Conv2D", "config": {"padding": "same", "strides": [1, 1], "filters": 32, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "name": "Conv2D_1_3_0_1", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["Conv2D_1_3_0_1", 0, 0, {}]]], "name": "BatchNorm1_1_3_0_1", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "trainable": true, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "BatchNorm1_1_3_0_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99}}, {"inbound_nodes": [[["BatchNorm1_1_3_0_1", 0, 0, {}]]], "name": "Act1_1_3_0_1", "class_name": "Activation", "config": {"name": "Act1_1_3_0_1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["Act1_1_3_0_1", 0, 0, {}]]], "name": "Conv2D_1_3_0_2", "class_name": "Conv2D", "config": {"padding": "same", "strides": [1, 1], "filters": 32, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "name": "Conv2D_1_3_0_2", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["Conv2D_1_3_0_2", 0, 0, {}]]], "name": "BatchNorm1_1_3_0_2", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "trainable": true, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "BatchNorm1_1_3_0_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99}}, {"inbound_nodes": [[["Actoutput1_2_0", 0, 0, {}], ["BatchNorm1_1_3_0_2", 0, 0, {}]]], "name": "Add_1_3_0", "class_name": "Add", "config": {"name": "Add_1_3_0", "trainable": true}}, {"inbound_nodes": [[["Add_1_3_0", 0, 0, {}]]], "name": "Actoutput1_3_0", "class_name": "Activation", "config": {"name": "Actoutput1_3_0", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["Actoutput1_3_0", 0, 0, {}]]], "name": "Conv2D_1_4_0_1", "class_name": "Conv2D", "config": {"padding": "same", "strides": [1, 1], "filters": 32, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "name": "Conv2D_1_4_0_1", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["Conv2D_1_4_0_1", 0, 0, {}]]], "name": "BatchNorm1_1_4_0_1", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "trainable": true, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "BatchNorm1_1_4_0_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99}}, {"inbound_nodes": [[["BatchNorm1_1_4_0_1", 0, 0, {}]]], "name": "Act1_1_4_0_1", "class_name": "Activation", "config": {"name": "Act1_1_4_0_1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["Act1_1_4_0_1", 0, 0, {}]]], "name": "Conv2D_1_4_0_2", "class_name": "Conv2D", "config": {"padding": "same", "strides": [1, 1], "filters": 32, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "name": "Conv2D_1_4_0_2", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["Conv2D_1_4_0_2", 0, 0, {}]]], "name": "BatchNorm1_1_4_0_2", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "trainable": true, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "BatchNorm1_1_4_0_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99}}, {"inbound_nodes": [[["Actoutput1_3_0", 0, 0, {}], ["BatchNorm1_1_4_0_2", 0, 0, {}]]], "name": "Add_1_4_0", "class_name": "Add", "config": {"name": "Add_1_4_0", "trainable": true}}, {"inbound_nodes": [[["Add_1_4_0", 0, 0, {}]]], "name": "Actoutput1_4_0", "class_name": "Activation", "config": {"name": "Actoutput1_4_0", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["Actoutput1_4_0", 0, 0, {}]]], "name": "Conv2D_1_5_0_1", "class_name": "Conv2D", "config": {"padding": "same", "strides": [1, 1], "filters": 32, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "name": "Conv2D_1_5_0_1", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["Conv2D_1_5_0_1", 0, 0, {}]]], "name": "BatchNorm1_1_5_0_1", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "trainable": true, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "BatchNorm1_1_5_0_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99}}, {"inbound_nodes": [[["BatchNorm1_1_5_0_1", 0, 0, {}]]], "name": "Act1_1_5_0_1", "class_name": "Activation", "config": {"name": "Act1_1_5_0_1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["Act1_1_5_0_1", 0, 0, {}]]], "name": "Conv2D_1_5_0_2", "class_name": "Conv2D", "config": {"padding": "same", "strides": [1, 1], "filters": 32, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "name": "Conv2D_1_5_0_2", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["Conv2D_1_5_0_2", 0, 0, {}]]], "name": "BatchNorm1_1_5_0_2", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "trainable": true, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "BatchNorm1_1_5_0_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99}}, {"inbound_nodes": [[["Actoutput1_4_0", 0, 0, {}], ["BatchNorm1_1_5_0_2", 0, 0, {}]]], "name": "Add_1_5_0", "class_name": "Add", "config": {"name": "Add_1_5_0", "trainable": true}}, {"inbound_nodes": [[["Add_1_5_0", 0, 0, {}]]], "name": "Actoutput1_5_0", "class_name": "Activation", "config": {"name": "Actoutput1_5_0", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["Actoutput1_5_0", 0, 0, {}]]], "name": "Conv2D_1_6_0_1", "class_name": "Conv2D", "config": {"padding": "same", "strides": [1, 1], "filters": 32, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "name": "Conv2D_1_6_0_1", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["Conv2D_1_6_0_1", 0, 0, {}]]], "name": "BatchNorm1_1_6_0_1", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "trainable": true, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "BatchNorm1_1_6_0_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99}}, {"inbound_nodes": [[["BatchNorm1_1_6_0_1", 0, 0, {}]]], "name": "Act1_1_6_0_1", "class_name": "Activation", "config": {"name": "Act1_1_6_0_1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["Act1_1_6_0_1", 0, 0, {}]]], "name": "Conv2D_1_6_0_2", "class_name": "Conv2D", "config": {"padding": "same", "strides": [1, 1], "filters": 32, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "name": "Conv2D_1_6_0_2", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["Conv2D_1_6_0_2", 0, 0, {}]]], "name": "BatchNorm1_1_6_0_2", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "trainable": true, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "BatchNorm1_1_6_0_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99}}, {"inbound_nodes": [[["Actoutput1_5_0", 0, 0, {}], ["BatchNorm1_1_6_0_2", 0, 0, {}]]], "name": "Add_1_6_0", "class_name": "Add", "config": {"name": "Add_1_6_0", "trainable": true}}, {"inbound_nodes": [[["Add_1_6_0", 0, 0, {}]]], "name": "Actoutput1_6_0", "class_name": "Activation", "config": {"name": "Actoutput1_6_0", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["Actoutput1_6_0", 0, 0, {}]]], "name": "Conv2D_1_7_0_1", "class_name": "Conv2D", "config": {"padding": "same", "strides": [1, 1], "filters": 32, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "name": "Conv2D_1_7_0_1", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["Conv2D_1_7_0_1", 0, 0, {}]]], "name": "BatchNorm1_1_7_0_1", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "trainable": true, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "BatchNorm1_1_7_0_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99}}, {"inbound_nodes": [[["BatchNorm1_1_7_0_1", 0, 0, {}]]], "name": "Act1_1_7_0_1", "class_name": "Activation", "config": {"name": "Act1_1_7_0_1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["Act1_1_7_0_1", 0, 0, {}]]], "name": "Conv2D_1_7_0_2", "class_name": "Conv2D", "config": {"padding": "same", "strides": [1, 1], "filters": 32, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "name": "Conv2D_1_7_0_2", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["Conv2D_1_7_0_2", 0, 0, {}]]], "name": "BatchNorm1_1_7_0_2", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "trainable": true, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "BatchNorm1_1_7_0_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99}}, {"inbound_nodes": [[["Actoutput1_6_0", 0, 0, {}], ["BatchNorm1_1_7_0_2", 0, 0, {}]]], "name": "Add_1_7_0", "class_name": "Add", "config": {"name": "Add_1_7_0", "trainable": true}}, {"inbound_nodes": [[["Add_1_7_0", 0, 0, {}]]], "name": "Actoutput1_7_0", "class_name": "Activation", "config": {"name": "Actoutput1_7_0", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["Actoutput1_7_0", 0, 0, {}]]], "name": "Conv2D_2_0_0_1", "class_name": "Conv2D", "config": {"padding": "same", "strides": [2, 2], "filters": 64, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "name": "Conv2D_2_0_0_1", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["Conv2D_2_0_0_1", 0, 0, {}]]], "name": "BatchNorm1_2_0_0_1", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "trainable": true, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "BatchNorm1_2_0_0_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99}}, {"inbound_nodes": [[["BatchNorm1_2_0_0_1", 0, 0, {}]]], "name": "Act1_2_0_0_1", "class_name": "Activation", "config": {"name": "Act1_2_0_0_1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["Act1_2_0_0_1", 0, 0, {}]]], "name": "Conv2D_2_0_0_2", "class_name": "Conv2D", "config": {"padding": "same", "strides": [1, 1], "filters": 64, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 